; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-5degree-100mindistance-2trucks-7packages-744seed

(define (problem transport-three-cities-sequential-3nodes-1000size-5degree-100mindistance-2trucks-7packages-744seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  package-7 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 550,837 -> 316,802
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 24)
  ; 316,802 -> 550,837
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 24)
  ; 344,532 -> 316,802
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 28)
  ; 316,802 -> 344,532
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 28)
  ; 344,532 -> 550,837
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 37)
  ; 550,837 -> 344,532
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 37)
  ; 2002,367 -> 2103,851
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 50)
  ; 2103,851 -> 2002,367
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 50)
  ; 2326,332 -> 2103,851
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 57)
  ; 2103,851 -> 2326,332
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 57)
  ; 2326,332 -> 2002,367
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 33)
  ; 2002,367 -> 2326,332
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 33)
  ; 1164,2299 -> 1270,2301
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 11)
  ; 1270,2301 -> 1164,2299
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 11)
  ; 1283,2936 -> 1270,2301
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 64)
  ; 1270,2301 -> 1283,2936
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 64)
  ; 1283,2936 -> 1164,2299
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 65)
  ; 1164,2299 -> 1283,2936
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 65)
  ; 550,837 <-> 2002,367
  (road city-1-loc-2 city-2-loc-2)
  (= (road-length city-1-loc-2 city-2-loc-2) 153)
  (road city-2-loc-2 city-1-loc-2)
  (= (road-length city-2-loc-2 city-1-loc-2) 153)
  (road city-1-loc-2 city-3-loc-2)
  (= (road-length city-1-loc-2 city-3-loc-2) 153)
  (road city-3-loc-2 city-1-loc-2)
  (= (road-length city-3-loc-2 city-1-loc-2) 153)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 179)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 179)
  (at package-1 city-1-loc-1)
  (at package-2 city-2-loc-1)
  (at package-3 city-3-loc-2)
  (at package-4 city-2-loc-3)
  (at package-5 city-2-loc-2)
  (at package-6 city-3-loc-2)
  (at package-7 city-1-loc-2)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-1-loc-1)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-1-loc-3)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-1)
  (at package-5 city-3-loc-1)
  (at package-6 city-2-loc-1)
  (at package-7 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-2 city-1-loc-1 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-4)
   added: (in package-1 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 7
2. (drive truck-2 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 7
3. (pick-up truck-2 city-1-loc-2 package-7 capacity-2 capacity-3)
   deleted: (at package-7 city-1-loc-2) (capacity truck-2 capacity-3)
   added: (in package-7 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 7
4. (drive truck-2 city-1-loc-2 city-3-loc-2)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-3-loc-2)
   goals met: 0 of 7
5. (pick-up truck-2 city-3-loc-2 package-6 capacity-1 capacity-2)
   deleted: (at package-6 city-3-loc-2) (capacity truck-2 capacity-2)
   added: (in package-6 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 7
6. (pick-up truck-2 city-3-loc-2 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-3-loc-2) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 7
7. (pick-up truck-1 city-2-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-2-loc-1) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 7
8. (drive truck-2 city-3-loc-2 city-1-loc-2)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 7
9. (drive truck-2 city-1-loc-2 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 7
10. (drop truck-2 city-2-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-0)
   added: (at package-3 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 7
11. (drop truck-2 city-2-loc-2 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-2-loc-2) (capacity truck-2 capacity-2)
   goals met: 2 of 7
12. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 2 of 7
13. (drive truck-1 city-2-loc-2 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-2)
   goals met: 2 of 7
14. (drive truck-1 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 7
15. (drop truck-1 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-1-loc-3) (capacity truck-1 capacity-2)
   goals met: 3 of 7
16. (drop truck-2 city-2-loc-2 package-7 capacity-2 capacity-3)
   deleted: (in package-7 truck-2) (capacity truck-2 capacity-2)
   added: (at package-7 city-2-loc-2) (capacity truck-2 capacity-3)
   goals met: 4 of 7
17. (pick-up truck-2 city-2-loc-2 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-2-loc-2) (capacity truck-2 capacity-3)
   added: (in package-5 truck-2) (capacity truck-2 capacity-2)
   goals met: 4 of 7
18. (drive truck-2 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-3)
   goals met: 4 of 7
19. (pick-up truck-2 city-2-loc-3 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-2-loc-3) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 4 of 7
20. (drive truck-2 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-1)
   goals met: 4 of 7
21. (drop truck-2 city-2-loc-1 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-1)
   added: (at package-4 city-2-loc-1) (capacity truck-2 capacity-2)
   goals met: 5 of 7
22. (drop truck-2 city-2-loc-1 package-6 capacity-2 capacity-3)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-2)
   added: (at package-6 city-2-loc-1) (capacity truck-2 capacity-3)
   goals met: 6 of 7
23. (drive truck-2 city-2-loc-1 city-3-loc-1)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-3-loc-1)
   goals met: 6 of 7
24. (drop truck-2 city-3-loc-1 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-3)
   added: (at package-5 city-3-loc-1) (capacity truck-2 capacity-4)
   goals met: 7 of 7
